ERP.belugaerp/src/DataProcessors/бг_АктуализацияДвиженийПоАкцизам/бг_АктуализацияДвиженийПоАкцизам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>бг_АктуализацияДвиженийПоАкцизам</name>
</mdclass:DataProcessor>

ERP.belugaerp/src/AccumulationRegisters/бг_АкцизПоПриобретеннымЦенностям/бг_АкцизПоПриобретеннымЦенностям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>бг_АкцизПоПриобретеннымЦенностям</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.битРасчетАвансовПоАкцизам</types>
      <types>CatalogRef.бг_БанковскиеГарантии</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеСырья</name>
    <type>
      <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеОплатыАванса</name>
    <type>
      <types>CatalogRef.бг_СостоянияОплатыАванса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусАкциза</name>
    <type>
      <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияПродукции</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/AccumulationRegisters/бг_АкцизПоПриобретеннымЦенностямВыпускПродукции/бг_АкцизПоПриобретеннымЦенностямВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипМестаХранения</name>
    <type>
      <types>EnumRef.ТипыМестХранения</types>
      <types>EnumRef.бг_ТипыМестХраненияПодакцизнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтАрендодателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПодотчетника</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратМатериаловИзКладовой</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНеперечисленныхДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОтРозничногоПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровЧерезКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииНаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭСТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпорту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпортуТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОказаниеАгентскихУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОформлениеГТДБрокером</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОформлениеГТДСамостоятельно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаВСоставОС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаМатериаловВКладовую</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаМатериаловВПроизводство</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОприходованиеЗаСчетДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаПродукцииИзПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеПолуфабрикатов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваровМеждуФилиалами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаДругойСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймаСотрудником</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоДепозитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоЗаймамВыданным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСДругогоСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоПлатежнойКарте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПриемНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПринятиеКУчетуОС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПринятиеКУчетуПредметовАренды</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияВнеоборотныхАктивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиентуРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияЧерезКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовНаПартииПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоставкаПодПринципала</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияПерепоставленногоТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеализацииУменьшениеЗадолженностиСводно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНедопоставленногоТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаПоСогласованиюСторон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеализацииУвеличениеЗадолженностиСводно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СписаниеДебиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СписаниеКредиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НачислениеДебиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаПриобретенияУменьшениеЗадолженностиСводно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаПриобретенияУвеличениеЗадолженностиСводно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНалогов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/DataProcessors/бг_АктуализацияДвиженийПоАкцизам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Восстанавливает движения по регистру бг_АкцизПоПриобретеннымЦенностям
//
// Параметры:
//  Аналитики     - Таблица значений с аналитикой, подлежащей восстановлению
//  НачалоПериода - Дата начала восстановления движений
//  КонецПериода  - Дата окончания восстановления движений
//
Процедура ВосстановитьПоследовательностьДвижений(Аналитики, НачалоПериода, КонецПериода) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аналитики.Организация КАК Организация,
	|	Аналитики.Номенклатура КАК Номенклатура,
	|	Аналитики.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Аналитики.Сделка КАК Сделка,
	|	Аналитики.СостояниеСырья КАК СостояниеСырья,
	|	Аналитики.СтатусАкциза КАК СтатусАкциза,
	|	Аналитики.Продукция КАК Продукция,
	|	Аналитики.СерияПродукции КАК СерияПродукции
	|ПОМЕСТИТЬ АналитикиВосстановлениеДвижений
	|ИЗ
	|	&Аналитики КАК Аналитики
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Номенклатура,
	|	СерияНоменклатуры,
	|	Сделка,
	|	СостояниеСырья,
	|	СтатусАкциза,
	|	Продукция,
	|	СерияПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АкцизПоПриобретеннымЦенностям.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(АкцизПоПриобретеннымЦенностям.Регистратор) КАК РегистраторПредставление,
	|	АкцизПоПриобретеннымЦенностям.Период КАК Период,
	|	ВЫБОР 
	|		КОГДА АкцизПоПриобретеннымЦенностям.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|			ТОГДА 0
	|		КОГДА АкцизПоПриобретеннымЦенностям.Регистратор ССЫЛКА Документ.ПоступлениеТоваровНаСклад
	|			ТОГДА 1
	|		КОГДА АкцизПоПриобретеннымЦенностям.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА 2
	|		КОГДА АкцизПоПриобретеннымЦенностям.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА 3
	|		КОГДА АкцизПоПриобретеннымЦенностям.Регистратор ССЫЛКА Документ.ЗаявлениеОВвозеТоваров
	|			ТОГДА 4
	|		КОГДА АкцизПоПриобретеннымЦенностям.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА 5
	|		КОГДА АкцизПоПриобретеннымЦенностям.Регистратор ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|			И ВЫРАЗИТЬ(АкцизПоПриобретеннымЦенностям.Регистратор КАК Документ.ДвижениеПродукцииИМатериалов).ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзКладовой)
	|			ТОГДА 6
	|		КОГДА АкцизПоПриобретеннымЦенностям.Регистратор ССЫЛКА Документ.ВнутреннееПотреблениеТоваров
	|			ТОГДА 7
	|		КОГДА АкцизПоПриобретеннымЦенностям.Регистратор ССЫЛКА Документ.ПроизводствоБезЗаказа
	|			ТОГДА 8
	|		КОГДА АкцизПоПриобретеннымЦенностям.Регистратор ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|			И ВЫРАЗИТЬ(АкцизПоПриобретеннымЦенностям.Регистратор КАК Документ.ДвижениеПродукцииИМатериалов).ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую)
	|			ТОГДА 9
	|		КОГДА АкцизПоПриобретеннымЦенностям.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	|			ТОГДА 10
	|		КОГДА АкцизПоПриобретеннымЦенностям.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА 11
	|		ИНАЧЕ 100
	|	КОНЕЦ КАК ПриоритетДокументов,
	|	ИСТИНА КАК Проведен
	|ИЗ
	|	АналитикиВосстановлениеДвижений КАК АналитикиВосстановлениеДвижений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям КАК АкцизПоПриобретеннымЦенностям
	|		ПО АналитикиВосстановлениеДвижений.Организация = АкцизПоПриобретеннымЦенностям.Организация
	|			И АналитикиВосстановлениеДвижений.Номенклатура = АкцизПоПриобретеннымЦенностям.Номенклатура
	|			И АналитикиВосстановлениеДвижений.СерияНоменклатуры = АкцизПоПриобретеннымЦенностям.СерияНоменклатуры
	|			И АналитикиВосстановлениеДвижений.Сделка = АкцизПоПриобретеннымЦенностям.Сделка
	|			И АналитикиВосстановлениеДвижений.СостояниеСырья = АкцизПоПриобретеннымЦенностям.СостояниеСырья
	|			И АналитикиВосстановлениеДвижений.СтатусАкциза = АкцизПоПриобретеннымЦенностям.СтатусАкциза
	|			И АналитикиВосстановлениеДвижений.Продукция = АкцизПоПриобретеннымЦенностям.Продукция
	|			И АналитикиВосстановлениеДвижений.СерияПродукции = АкцизПоПриобретеннымЦенностям.СерияПродукции
	|ГДЕ
	|	АкцизПоПриобретеннымЦенностям.Период >= &НачалоПериода
	|	И АкцизПоПриобретеннымЦенностям.Период <= &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(АкцизПоПриобретеннымЦенностям.Регистратор) В (&ОбрабатываемыеТипыДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	ПриоритетДокументов";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И АкцизПоПриобретеннымЦенностям.Период <= &КонецПериода", "");
	
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Аналитики",     Аналитики);
	Запрос.УстановитьПараметр("ОбрабатываемыеТипыДокументов", 
		ОбрабатываемыеТипыДокументовВосстановлениеПоследовательностиДвижений());
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	СформироватьДвиженияПоАкцизам(Выборка);
КонецПроцедуры

Процедура СформироватьДвиженияПоАкцизам(ВыборкаДокументы) Экспорт
	НачатьТранзакцию();
	
	Попытка
		Отказ = Ложь;
		
		// Очистка движений
		Пока ВыборкаДокументы.Следующий() Цикл
			ОчиститьДвиженияПоАкцизам(ВыборкаДокументы.Регистратор);
		КонецЦикла;
		
		ВыборкаДокументы.Сбросить();
		
		Пока ВыборкаДокументы.Следующий() Цикл
			Если Не ВыборкаДокументы.Проведен Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаблокироватьДанныеДляРедактирования(ВыборкаДокументы.Регистратор);
			
			ДокументОбъект = ВыборкаДокументы.Регистратор.ПолучитьОбъект();
			СформироватьДвижения(ДокументОбъект, Отказ);
			
			Если Отказ Тогда
				ВызватьИсключение ОписаниеОшибки();
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Переформированы движения по акцизам %1 документов'"), 
			ВыборкаДокументы.Количество());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	Исключение
		ОтменитьТранзакцию();
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось переформировать движения для %1. %2'"), 
			ВыборкаДокументы.РегистраторПредставление, ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("бг_АктуализацияДвиженийПоАкцизам", 
			УровеньЖурналаРегистрации.Ошибка, , ,
			ТекстСообщения);	
			
		ВызватьИсключение НСтр("ru = 'Не удалось восстановить последовательность движений'");
	КонецПопытки;
КонецПроцедуры

// Переформировывает движения по регистру бг_АкцизПоПриобретеннымЦенностям 
// на основании результата запроса
//
// Параметры:
//  РезультатЗапроса - Резултат запроса выборки документов с группировкой по дням
//
Процедура СформироватьДвиженияПоАкцизамПоДням(РезультатЗапроса) Экспорт
	
	ВыборкаПоДням = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоДням.Следующий() Цикл
		
		ВыборкаДокументы = ВыборкаПоДням.Выбрать();
		
		НачатьТранзакцию();
		
		Попытка
			Отказ = Ложь;
			
			// Очистка движений
			Пока ВыборкаДокументы.Следующий() Цикл
				ОчиститьДвиженияПоАкцизам(ВыборкаДокументы.Регистратор);
			КонецЦикла;
			
			ВыборкаДокументы.Сбросить();
			
			Пока ВыборкаДокументы.Следующий() Цикл
				
				ЗаблокироватьДанныеДляРедактирования(ВыборкаДокументы.Регистратор);
				
				ДокументОбъект = ВыборкаДокументы.Регистратор.ПолучитьОбъект();
				СформироватьДвижения(ДокументОбъект, Отказ);
				
				Если Отказ Тогда
					ВызватьИсключение ОписаниеОшибки();
				КонецЕсли;
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
			ТекстСообщения = СтрШаблон(НСтр("ru = '%2: Переформированы движения по акцизам %1 документов'"), 
				ВыборкаДокументы.Количество(), Формат(ВыборкаПоДням.Дата, "ДФ=dd.MM.yyyy"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Исключение
			ОтменитьТранзакцию();
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось переформировать движения для %1. %2'"), 
				ВыборкаДокументы.РегистраторПредставление, ОписаниеОшибки());
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("бг_АктуализацияДвиженийПоАкцизам", 
				УровеньЖурналаРегистрации.Ошибка, , ,
				ТекстСообщения);	
			
			ВызватьИсключение НСтр("ru = 'Не удалось восстановить последовательность движений'");
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьДвиженияПоАкцизам(ДокументСсылка)
	НаборЗаписей = РегистрыНакопления.бг_АкцизПоПриобретеннымЦенностям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПересчетДвижений");
	НаборЗаписей.Записать();
	
	МетаданныеРегистрВыпускПродукции = Метаданные.РегистрыНакопления.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции;
	Если МетаданныеРегистрВыпускПродукции.СтандартныеРеквизиты.Регистратор.Тип.СодержитТип(ТипЗнч(ДокументСсылка)) Тогда
		НаборЗаписей = РегистрыНакопления.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьДвижения(ДокументОбъект, Отказ)
	// Перезаполнение акцизов
	ИмяМетаданныхДокумента = ДокументОбъект.Метаданные().Имя;
	ДокументыПерезаполненияАкциза = "ЗаявлениеОВвозеТоваров, КорректировкаРеализации, ТаможеннаяДекларацияИмпорт";
	Если СтрНайти(ДокументыПерезаполненияАкциза, ИмяМетаданныхДокумента) = 0 Тогда
		ДокументОбъект.ДополнительныеСвойства.Вставить("бг_ЗаполнитьАкцизыПоПриобретеннымЦенностям", Истина);
		ДокументОбъект.бг_ЗаполнитьАкцизыПоПриобретеннымЦенностям(Отказ);
	КонецЕсли;
	
	ДокументОбъект.ДополнительныеСвойства.Вставить("адаптер_ЭтоГрупповаяОбработкаДанных", Истина);
	ДокументОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать();
	
	Регистры = Новый Структура;
	Регистры.Вставить("бг_АкцизПоПриобретеннымЦенностям");
	Регистры.Вставить("бг_АкцизПоПриобретеннымЦенностямВыпускПродукции");
	
	ТаблицыДляДвижений = ПроведениеДокументов.ДанныеДокументаДляПроведения(ДокументОбъект.Ссылка, Регистры);
	
	бг_УчетБанковскихГарантий.ОтразитьДвижения(ТаблицыДляДвижений, ДокументОбъект.Движения, Ложь);
	
	Для каждого Регистр Из Регистры Цикл
		Если ДокументОбъект.Движения.Найти(Регистр.Ключ) <> Неопределено Тогда
			ДокументОбъект.Движения[Регистр.Ключ].Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ОбрабатываемыеТипыДокументовВосстановлениеПоследовательностиДвижений()
	ОбрабатываемыеТипыДокументов = Новый Массив;
	ОбрабатываемыеТипыДокументов.Добавить(Тип("ДокументСсылка.ВнутреннееПотреблениеТоваров"));
	ОбрабатываемыеТипыДокументов.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтКлиента"));
	ОбрабатываемыеТипыДокументов.Добавить(Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов"));
	ОбрабатываемыеТипыДокументов.Добавить(Тип("ДокументСсылка.ПересортицаТоваров"));
	ОбрабатываемыеТипыДокументов.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровНаСклад"));
	ОбрабатываемыеТипыДокументов.Добавить(Тип("ДокументСсылка.ПроизводствоБезЗаказа"));
	ОбрабатываемыеТипыДокументов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	ОбрабатываемыеТипыДокументов.Добавить(Тип("ДокументСсылка.СборкаТоваров"));
	ОбрабатываемыеТипыДокументов.Добавить(Тип("ДокументСсылка.ЭтапПроизводства2_2"));
	
	Возврат ОбрабатываемыеТипыДокументов;
КонецФункции

#КонецОбласти

#КонецЕсли
